package com.cheng.operator;

public class Demo06 {
    public static void main(String[] args) {
 /*
        A = 0011 1100
        B = 0000 1101
        ----------------------
        A&B = 0000 1100 &:都是1则为1 否则为0
        A|B = 0011 1101 |:有1则为1，否则为0
        A^B = 0011 0001 ^:不同则为1，相同则为0
        ~B = 1111 0010 ~B:取反B，是1则为0，是0则为1
        -----------------------
        2<<3 = 16
        << 左移 *2 2<<3;2左移3位 2<<3=2*2^3
        >> 右移 /2 16>>3;6右移3位 6<<3=6/2^3
       位运算效率极高！！！
       0000 0000 0
       0000 0001 1
       0000 0010 2
       0000 0011 3
       0000 0100 4
       0000 1000 8
       0001 0000 16

       2往左移3位为16
         */




        System.out.println(4>>1);//8
        System.out.println(2<<3);//1
    }
}
